################################################
# Brewfile to install MacOS Tools & Applications
################################################

# Taps
tap 'homebrew/bundle'
tap 'homebrew/services'

# Formulae
brew 'git' # Distributed revision control system
brew 'mas' # Mac App Store command-line interface
brew 'mkcert' # Simple tool to make locally trusted development certificates
brew 'node' # Platform built on V8 to build network applications
brew 'nvm' # Manage multiple Node.js versions
brew 'trash-cli' # Command-line interface to the freedesktop.org trashcan
brew 'wget' # Internet file retriever
brew 'yarn' # JavaScript package manager
brew 'youtube-dl' # Download YouTube videos from the command-line
brew 'zsh' # UNIX shell (command interpreter)
brew 'zsh-completions' # Additional completion definitions for zsh

# Casks
cask_args appdir: '/Applications'
cask 'alfred' # Application launcher and productivity software
cask 'boop' # Scriptable scratchpad for developers
cask 'brave-browser' # Web browser focused on privacy
cask 'calibre' # E-books management software
cask 'discord' # Voice and text chat software
cask 'disk-inventory-x' # Disk usage utility
cask 'displaylink' # Drivers for DisplayLink docks, adapters and monitors
cask 'firefox' # Web browser
cask 'geotag' # Geo location editor for images
cask 'google-chrome' # Web browser
cask 'handbrake' # Open-source video transcoder
cask 'iina' # Free and open-source media player
cask 'imagemagick' # Tools and libraries to manipulate images in many formats
cask 'imageoptim' # Tool to optimize images to a smaller size
cask 'iterm2' # Terminal emulator as alternative to Apple's Terminal app
cask 'kap' # Open-source screen recorder built with web technology
cask 'keepingyouawake' # Tool to prevent the system from going into sleep mode
cask 'ksdiff' # Command-line tool for the App Store version of Kaleidoscope
cask 'menubar-stats' # System monitor with temperature & fans plugins
cask 'microsoft-edge' # Web browser
cask 'postman' # Collaboration platform for API development
cask 'rocket' # Emoji picker
cask 'sequel-ace' # MySQL/MariaDB database management
cask 'signal' # Instant messaging application focusing on security
cask 'skitch' # Screen capture tool with mark up and sharing features
cask 'slack' # Team communication and collaboration software
cask 'sourcetree' # Graphical client for Git version control
cask 'visual-studio-code' # Open-source code editor
cask 'vlc' # Multimedia player
cask 'xscope' # Tools for measuring, inspecting & testing on-screen graphics and layouts
cask 'zoom' # Video communication and virtual meeting platform

# Fonts
cask 'font-fira-code'
cask 'font-victor-mono'

# Mac App Store
mas 'Affinity Photo', id: 824183456
mas 'Kaleidoscope', id: 587512244
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541

# VSCode Extensions
vscode "aaron-bond.better-comments"
vscode "ambar.bundle-size"
vscode "bibhasdn.unique-lines"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "cpylua.language-postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "earshinov.permute-lines"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-browser-refresh"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jasonnutter.search-node-modules"
vscode "joelday.docthis"
vscode "mblode.twig-language"
vscode "ms-vscode.sublime-keybindings"
vscode "orta.vscode-twoslash-queries"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "saoudrizwan.claude-dev"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "tyriar.sort-lines"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
