##########################################
# Brewfile: Install all the MacOS things! #
##########################################

# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

# Formulae
brew 'docker' # Pack, ship and run any application as a lightweight container
brew 'docker-compose' # Isolated development environments using Docker
brew 'git' # Distributed revision control system
brew 'mas' # Mac App Store command-line interface
brew 'mkcert' # Simple tool to make locally trusted development certificates
brew 'node' # Platform built on V8 to build network applications
brew 'nvm' # Manage multiple Node.js versions
brew 'wget' # Internet file retriever
brew 'yarn' # JavaScript package manager
brew 'youtube-dl' # Download YouTube videos from the command-line
brew 'zsh' # UNIX shell (command interpreter)
brew 'zsh-completions' # Additional completion definitions for zsh

# Casks
cask_args appdir: '/Applications'
cask 'alfred' # Application launcher and productivity software
cask 'boop' # Scriptable scratchpad for developers
cask 'brave-browser' # Web browser focused on privacy
cask 'calibre' # E-books management software
cask 'discord' # Voice and text chat software
cask 'disk-inventory-x' # Disk usage utility
# cask 'displaylink' # Drivers for DisplayLink docks, adapters and monitors
cask 'dropbox' # Client for the Dropbox cloud storage service
cask 'fig' # Reimagine your terminal
cask 'firefox' # Web browser
cask 'geotag' # Geo location editor for images
cask 'google-chrome' # Web browser
cask 'handbrake' # Open-source video transcoder
cask 'iina' # Free and open-source media player
cask 'imagemagick' # Tools and libraries to manipulate images in many formats
cask 'imageoptim' # Tool to optimize images to a smaller size
cask 'iterm2' # Terminal emulator as alternative to Apple's Terminal app
cask 'kap' # Open-source screen recorder built with web technology
cask 'keepingyouawake' # Tool to prevent the system from going into sleep mode
cask 'ksdiff' # Command-line tool for the App Store version of Kaleidoscope
cask 'menubar-stats' # System monitor with temperature & fans plugins
cask 'microsoft-edge' # Web browser
cask 'postman' # Collaboration platform for API development
cask 'rocket' # Emoji picker
cask 'sequel-ace' # MySQL/MariaDB database management
cask 'signal' # Instant messaging application focusing on security
cask 'skitch' # Screen capture tool with mark up and sharing features
cask 'slack' # Team communication and collaboration software
cask 'sourcetree' # Graphical client for Git version control
cask 'todoist' # To-do list
cask 'visual-studio-code' # Open-source code editor
cask 'vlc' # Multimedia player
cask 'xscope' # Tools for measuring, inspecting & testing on-screen graphics and layouts
cask 'zoom' # Video communication and virtual meeting platform

# Fonts
cask 'font-fira-code'
cask 'font-input-mono'
cask 'font-victor-mono'

# Mac App Store
mas 'Affinity Photo', id: 824183456
# mas 'Boop', id: 1518425043
# mas 'GeoTag', id: 1465180184
mas 'Kaleidoscope', id: 587512244
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
# mas 'MenuBar Stats', id: 714196447
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
# mas 'Pocket', id: 568494494
# mas 'Sequel Ace', id: 1518036000
# mas 'Skitch', id: 425955336
# mas 'Slack', id: 803453959
# mas 'Todoist', id: 585829637
# mas 'Trello', id: 1278508951
